app/Controllers/CarritoController.php

    public function index()
    {
        $producto = new ProductosModel();
        $datos['productos'] = $producto->findAll();
---
SELECT *
FROM `productos`