app/Controllers/CategoriasController.php

    public function index()
    {
        $categoria = new CategoriasModel();
        $producto = new ProductosModel();
        $datos['productos'] = $producto->findAll();
---
SELECT *
FROM `cat_productos`
SELECT *
FROM `productos`