app/Controllers/Home.php

SELECT *
FROM `cat_productos`
SELECT *
FROM `productos`
---
    public function index()
    {
        $producto = new ProductosModel();
        $categoria = new CategoriasModel();
        $datos['categorias'] = $categoria->findAll();
        $datos['productos'] = $producto->findAll();